AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлатежиПоРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлатежиПоРеструктуризацииДолга</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаменыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаменыПриборовУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоСубсидиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоСубсидиям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПечатьКвитанцииНаОплату/Ext/Module.bsl
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
	
КонецФункции // глРазложить

Функция ПолучитьПредставлениеАдреса(Массив, Квартира, КодЯзыкаПечать) Экспорт 
	
	СтрокаАдрес = "";
	Сч = Массив.ВГраница();
	Пока НЕ(Сч < 0) Цикл
		Если Сч = 3 Тогда   //Массив.ВГраница()  Тогда
			СтрокаАдрес = Массив[Сч];
		Иначе
			Если Сч = 1 ИЛИ Сч = 0 Тогда
			    СтрокаАдрес = СтрокаАдрес+", "+Массив[Сч];
			КонецЕсли;
		КонецЕсли;
		Сч = Сч-1;
	КонецЦикла;
	//СтрокаАдрес = СтрокаАдрес + ?(Квартира.Подъезд = Справочники.Подъезды.ПустаяСсылка(),"",", "Квартира.Подъезд.Наименование)
			//+ Квартира.Наименование;
      СтрокаАдрес = СтрокаАдрес + ", " + Квартира;
			
			Если КодЯзыкаПечать = "uk" Тогда
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес, "дом","буд");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Подъезд","Під'їзд");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Секция","Секція");
			Иначе
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Під'їз","Подъезд");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Секція","Секция");
			КонецЕсли;
			
	Возврат СтрокаАдрес; 
	
КонецФункции // ПолучитьПредставлениеАдреса()

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьОбщуюСтруктуруКвитанции(ЛицевыеСчета, МесяцНачисления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РасчетПоказанийПриборовУчетаОстаткиИОбороты.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ОПУ
	               |ИЗ
	               |	РегистрНакопления.РасчетПоказанийПриборовУчета.ОстаткиИОбороты(, , Авто, , ОбъектУстановки В (&ЛицевыеСчета)) КАК РасчетПоказанийПриборовУчетаОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	               |	СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК ТекущиеПоказания,
	               |	СУММА(0) КАК ПредыдущиеПоказания,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа
	               |ПОМЕСТИТЬ ПУ
	               |ИЗ
	               |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	               |			КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ),
	               |			ПриборУчета В
	               |				(ВЫБРАТЬ
	               |					ОПУ.ПриборУчета
	               |				ИЗ
	               |					ОПУ КАК ОПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(0),
	               |	СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение),
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |ИЗ
	               |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	               |			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ДЕНЬ, -1),
	               |			ПриборУчета В
	               |				(ВЫБРАТЬ
	               |					ОПУ.ПриборУчета
	               |				ИЗ
	               |					ОПУ КАК ОПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
	               |ГДЕ
	               |	ПоказанияПриборовУчетаСрезПоследних.Период < КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет КАК ЛицевойСчет,
	               |	ПлатежиПоРеструктуризацииДолга.СуммаПлатежа КАК СуммаПлатежа,
	               |	ПлатежиПоРеструктуризацииДолга.ОбщаяСумма КАК ОбщаяСумма,
	               |	ПлатежиПоРеструктуризацииДолга.Регистратор КАК ДокументРеструктуризации
	               |ПОМЕСТИТЬ ПРД
	               |ИЗ
	               |	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	               |ГДЕ
	               |	ПлатежиПоРеструктуризацииДолга.Период >= КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ПлатежиПоРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ КАК Организация
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет,
	               |	Организация,
	               |	Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(ЕСТЬNULL(ПУ.ТекущиеПоказания, 0)) КАК ТекущиеПоказания,
	               |	СУММА(ЕСТЬNULL(ПУ.ПредыдущиеПоказания, 0)) КАК ПредыдущиеПоказания,
	               |	ПУ.ПриборУчета.Коэффициент,
	               |	КОЛИЧЕСТВО(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета) КАК КоличествоПиборовНаУслуге,
	               |	ПУ.ПриборУчета.Услуга КАК Услуга,
	               |	ПУ.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПУ.ВидТарифа КАК ВидТарифа,
	               |	ПУ.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ПУ.ПриборУчета.Услуга.ВидУслуги.Наименование КАК ВидУслуги
	               |ИЗ
	               |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПУ КАК ПУ
	               |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПУ.ПриборУчета
	               |ГДЕ
	               |	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	ПУ.ПриборУчета.Коэффициент,
	               |	ПУ.ПриборУчета.Услуга,
	               |	ПУ.ПриборУчета.ЕдиницаИзмерения,
	               |	ПУ.ВидТарифа,
	               |	ПУ.ПриборУчета.ЗаводскойНомер,
	               |	ПУ.ПриборУчета.Услуга.ВидУслуги.Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаменыПриборовУчета.ОбъектУстановки,
	               |	ЗаменыПриборовУчета.ПриборУчета,
	               |	ЗаменыПриборовУчета.Показание,
	               |	ЗаменыПриборовУчета.ПоказаниеПредыдущее,
	               |	ЗаменыПриборовУчета.ПриборУчета.Коэффициент,
	               |	0,
	               |	ЗаменыПриборовУчета.Услуга,
	               |	ЗаменыПриборовУчета.ПриборУчета.ЕдиницаИзмерения,
	               |	ЗаменыПриборовУчета.ВидТарифа,
	               |	ЗаменыПриборовУчета.ПриборУчета.ЗаводскойНомер,
	               |	ЗаменыПриборовУчета.Услуга.ВидУслуги.Наименование
	               |ИЗ
	               |	РегистрНакопления.ЗаменыПриборовУчета КАК ЗаменыПриборовУчета
	               |ГДЕ
	               |	ЗаменыПриборовУчета.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ЗаменыПриборовУчета.ОбъектУстановки В(&ЛицевыеСчета)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.Тариф КАК Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено КАК ДнейНачислено,
	               |	СУММА(ЕСТЬNULL(ВЫБОР
	               |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |						ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |					ТОГДА РасчетыПоЛицевымСчетам.Количество
	               |			КОНЕЦ, 0)) КАК КоличествоЕдИзм,
	               |	СУММА(ВЫБОР
	               |			КОГДА (РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.КачествоУслуги))
	               |					И РасчетыПоЛицевымСчетам.ВидНачисленияПерерасчет <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Начисление,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА -РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Субсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА -РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Льгота,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисленияПерерасчет = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Перерасчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |					И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Оплата,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.КачествоУслуги)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Корректировка,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """") КАК Порог,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетам.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетам.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ КАК Организация,
	               |	РасчетыПоЛицевымСчетам.ВидТарифа КАК ВидТарифа
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевыеСчета)
	               |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И РасчетыПоЛицевымСчетам.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """"),
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетам.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетам.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ,
	               |	РасчетыПоЛицевымСчетам.ВидТарифа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга.ЕдиницаИзмерения,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.ОбъектЛицевогоСчета,
	               |	СУММА(0),
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга.ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.ОбъектЛицевогоСчета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |ИТОГИ
	               |	СУММА(КоличествоЕдИзм),
	               |	СУММА(Начисление),
	               |	СУММА(Субсидия),
	               |	СУММА(Льгота),
	               |	СУММА(Перерасчет),
	               |	СУММА(Оплата),
	               |	СУММА(Корректировка)
	               |ПО
	               |	Организация,
	               |	ЛицевойСчет,
	               |	Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланированиеАвансовЛицевыеСчета.ЛицевойСчет,
	               |	ПланированиеАвансовЛицевыеСчета.СуммаНачислено КАК СуммаАванса,
	               |	ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга
	               |ИЗ
	               |	Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ПланированиеАвансовЛицевыеСчета.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&МесяцНачисления, МЕСЯЦ, 1), МЕСЯЦ)
	               |	И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРД.ЛицевойСчет КАК ЛицевойСчет,
	               |	ПРД.СуммаПлатежа КАК СуммаПлатежа,
	               |	ПРД.ОбщаяСумма КАК ОбщаяСумма,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0) КАК Оплаты,
	               |	ПРД.ОбщаяСумма - ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0) КАК ОстатокРеструктуризации,
	               |	ПРД.ДокументРеструктуризации
	               |ИЗ
	               |	ПРД КАК ПРД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), , , Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |		ПО ПРД.ЛицевойСчет = РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
	               |ГДЕ
	               |	ПРД.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	               |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ КАК Организация
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет,
	               |	Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоговорРеструктуризацииДолга.Ссылка
	               |ИЗ
	               |	Документ.ДоговорРеструктуризацииДолга КАК ДоговорРеструктуризацииДолга
	               |ГДЕ
	               |	ДоговорРеструктуризацииДолга.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ДоговорРеструктуризацииДолга.Проведен = ИСТИНА
	               |	И ДоговорРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоСубсидиям.ЛицевойСчет,
	               |	РасчетыПоСубсидиям.МесяцНачисления,
	               |	РасчетыПоСубсидиям.Услуга,
	               |	МАКСИМУМ(РасчетыПоСубсидиям.ГраницаСубсидии) КАК ГраницаСубсидии
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоСубсидиям КАК РасчетыПоСубсидиям
	               |ГДЕ
	               |	РасчетыПоСубсидиям.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И РасчетыПоСубсидиям.ЛицевойСчет В(&ЛицевыеСчета)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоСубсидиям.ЛицевойСчет,
	               |	РасчетыПоСубсидиям.Услуга,
	               |	РасчетыПоСубсидиям.МесяцНачисления";
	
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

Функция ПечатьКвитанцииНаОплату(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации) Экспорт
	ГлобальнаяВыборка = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент, МесяцНачислений);
	// Заполнение таблицы
	ЕстьРеструктуризация           = НЕ ГлобальнаяВыборка[9].Пустой();
	ВыборкаОрганизация             = ГлобальнаяВыборка[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПриборыУчета            = ГлобальнаяВыборка[4].Выбрать();
	Если ЕстьРеструктуризация Тогда;
		ВыборкаОбщийОстаток        = ГлобальнаяВыборка[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаОбщийОстаток        = ГлобальнаяВыборка[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	ВыборкаАвансовыхПлатежей       = ГлобальнаяВыборка[6].Выбрать();
	ВыборкаПоРеструктуризацииДолга = ГлобальнаяВыборка[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОстатокПоУслугам        = ГлобальнаяВыборка[8].Выгрузить();
	ВыборкаГраницаСубсидии         = ГлобальнаяВыборка[10].Выбрать();
	
	Макет = ПолучитьОбщийМакет("МакетКвитанцииНаОплату");
	
	Если НЕ ГлобальнаяВыборка[5].Пустой() Тогда   
		// Заповнення шапки квитанції по даним організації
		Пока ВыборкаОрганизация.Следующий() Цикл
			// Кваліфікатор числа
			КЧ = Новый КвалификаторыЧисла(15,2);
			ИспользуютсяАвансовыеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи");
			АвансовыйПлатежВсего = 0;
			ВыборкаПриборыУчета.Сбросить();
			ТаблицаДляРасчетаИтогов = Новый ТаблицаЗначений;
			ТаблицаДляРасчетаИтогов.Колонки.Добавить("КОплате", Новый ОписаниеТипов("Число",,,КЧ));
			ТаблицаДляРасчетаИтогов.Очистить();
						
			ЗначениеРеструктуризацииДолга = 0;
			ЗадолженностьПоРеструктуризации = 0;
			МесячнаяПлатаПоРеструктуризации = 0;
			
			//Получаем настройки печати квитанции
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			//Для удобства накапливаем переменные
			Квартира = ТекущийДокумент.ОбъектЛицевогоСчета;
						
			//Создадим адрес в необходимои формате
			АдресМасс = РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Наименование);
			
			// ШАПКА
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
			ОбластьШапка.Параметры.Получатель =ВыборкаОрганизация.Организация.НаименованиеПолное;
			ОбластьШапка.Параметры.ЄДРПОУ = ВыборкаОрганизация.Организация.КодПоЕДРПОУ;		
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			// Область макета Банковский счет
			ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчет");
			Для Каждого Строка Из БанковскиеСчетаОрганизации Цикл
				Если Строка.Печать Тогда
					Если ВыборкаОрганизация.Организация = Строка.БанковскийСчет.Владелец Тогда
						ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчет");
						ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
						ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
						ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
						
						ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла;
			
			// Область макета ШапкаОсновнойЧасти
			ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(НачалоМесяца(МесяцНачислений),Новый Структура("Помещение", Квартира));
			
			ОбластьШапкаОсновнойЧасти = Макет.ПолучитьОбласть("ШапкаОсновнойЧасти");
			
			// Площади помещений
			Для Каждого Строка Из ВыборкаПлощади Цикл
				Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьОтоп = Строка.Площадь;
				ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьВся = Строка.Площадь;
				КонецЕсли;
			КонецЦикла;
			
			// Ответственные владельцы
			ВыборкаКолПроживающих = РегистрыСведений.ЛицевыеСчета.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			ВыборкаМашиномест = РегистрыСведений.МашиноМеста.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			Попытка
				Если Константы.ВыводитьВКвитанцияхФИО.Получить() = Истина Тогда
					Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование; 
				Иначе
					Плательщик = "";
				КонецЕсли;
				ОбластьШапкаОсновнойЧасти.Параметры.Плательщик = Плательщик;
			Исключение
			КонецПопытки;
			НазначениеПлатежа = ТекущийДокумент.Владелец.ТекстНазначенияПлатежа;
			ОбластьШапкаОсновнойЧасти.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
			
			ОбластьШапкаОсновнойЧасти.Параметры.ЛицевойСчет = ТекущийДокумент;
			
			Если Константы.ВыводитьАдресВКвитанциях.Получить() = Истина Тогда
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира,КодЯзыкаПечать);
			Иначе
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ТекущийДокумент;
			КонецЕсли;		
			
			ТабличныйДокумент.Вывести(ОбластьШапкаОсновнойЧасти);
			
			// Шапка таблицы послуг
			ОбластьШапкиТаблицыУслуг = Макет.ПолучитьОбласть("ШапкаТаблицыУслуг");
			
			// Табличная часть макета с услугами и приборами учета
			ВыборкаЛицевойСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Выбираем по каждому ЛС
			Пока ВыборкаЛицевойСчет.Следующий() Цикл
				ВыборкаУслуга     = ВыборкаЛицевойСчет.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Корректировка     = ВыборкаЛицевойСчет.Корректировка;
				Перерасчет        = ВыборкаЛицевойСчет.Перерасчет;
				Субсидия          = ВыборкаЛицевойСчет.Субсидия;
				Льгота            = ВыборкаЛицевойСчет.Льгота;
				НачисленоГрнВсего = ВыборкаЛицевойСчет.Начисление;
				
				НачисленоВсего = НачисленоГрнВсего + Перерасчет + Корректировка;
				
				// Залишки по оплаті за минулі періоди
				СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
				СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;
				ПервыйСчетчик = Истина;
				ОстатокНаКонецМесяца = Неопределено;
				Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
					ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаОстатковОрганизация.следующий() Цикл
						ОрганизацияОтбор = Неопределено;
						Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
							ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
						Иначе
							ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
						КонецЕсли;	
						Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
							ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				ВыборкаОбщийОстаток.Сбросить();
				Если ОстатокНаКонецМесяца = Неопределено Тогда
					ОстатокНаКонецМесяца = 0;
				КонецЕсли;
				
				// Оплати
				Оплаты = ВыборкаЛицевойСчет.Оплата;
				Если ЕстьРеструктуризация Тогда
					Остаток =  ОстатокНаКонецМесяца  - Корректировка - Перерасчет;
					Всего = НачисленоВсего + Остаток;
					Если Остаток < 0 Тогда
						ОбластьШапкиТаблицыУслуг.Параметры.ДатаДолга = "Переплата на: " + Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
						Остаток = -1 * Остаток;
					Иначе	
						ОбластьШапкиТаблицыУслуг.Параметры.ДатаДолга = "Борг на: " + Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					КонецЕсли;
					ОбластьШапкиТаблицыУслуг.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкиТаблицыУслуг);
				ИНаче
					Остаток = ОстатокНаКонецМесяца;
					Всего = НачисленоВсего + Остаток - Оплаты;
					Если Остаток < 0 Тогда
						ОбластьШапкиТаблицыУслуг.Параметры.ДатаДолга = "Переплата на: " + Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
						Остаток = -1 * Остаток;
					Иначе	
						ОбластьШапкиТаблицыУслуг.Параметры.ДатаДолга = "Борг на: " + Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					КонецЕсли;
					ОбластьШапкиТаблицыУслуг.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкиТаблицыУслуг);
				КонецЕсли;
				Если Остаток > 0 Тогда
					ПризнакАванса = Ложь;					
				Иначе
					ПризнакАванса = Истина;
				КонецЕсли;
				
				// Формирование данных по услугам
				Таблица = Новый ТаблицаЗначений;
				Таблица.Колонки.Добавить("Услуга",,"Услуга");
				Таблица.Колонки.Добавить("Счетчик",,"Счетчик");
				Таблица.Колонки.Добавить("Коэффициент",,"Коэффициент");
				Таблица.Колонки.Добавить("ЕдИзм",,"ЕдИзм");
				Таблица.Колонки.Добавить("Тариф",,"Тариф");
				Таблица.Колонки.Добавить("Норма",,"Норма");
				Таблица.Колонки.Добавить("ТекущиеПоказания",,"ТекущиеПоказания");
				Таблица.Колонки.Добавить("ПредыдущиеПоказания",,"ПредыдущиеПоказания");
				Таблица.Колонки.Добавить("Начисление",,"Начисление");
				Таблица.Колонки.Добавить("КоличествоЕдиниц",,"КоличествоЕдиниц");
				Таблица.Колонки.Добавить("Корректировка",,"Корректировка");
				Таблица.Колонки.Добавить("ПриборУчета");
				Таблица.Колонки.Добавить("ЛицевойСчет");
				
				Пока ВыборкаУслуга.Следующий() Цикл
					СтруктураПоискаПриборов = Новый Структура("ОбъектУстановки, Услуга");
					СтруктураПоискаПриборов.ОбъектУстановки = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаПриборов.Услуга = ВыборкаУслуга.Услуга;
					Марк = Истина;
					НоваяУслуга = "";
					СтараяУслуга = "";
					Пока ВыборкаПриборыУчета.НайтиСледующий(СтруктураПоискаПриборов) Цикл
						КорректировкаПоПрибору = 0;
						ПерерасчетПоприбору = 0;
						НоваяУслуга = ВыборкаУслуга.Услуга;
						Строка = Таблица.Добавить();
						Строка.Услуга = ВыборкаУслуга.Услуга.ПолноеНаименование;
						Строка.Счетчик = ВыборкаПриборыУчета.ЗаводскойНомер + "/" + ВыборкаПриборыУчета.ВидУслуги;
						Строка.ПриборУчета = ВыборкаПриборыУчета.ПриборУчета;
						Строка.ЛицевойСчет = ВыборкаПриборыУчета.ОбъектУстановки;
						Строка.Коэффициент = ВыборкаПриборыУчета.ПриборУчетаКоэффициент;
						Строка.ЕдИзм = ВыборкаУслуга.ЕдиницаИзмерения;
						ВыборкаТариф = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Тариф = "";
						КоличествоЕдиниц = 0;
						Пока ВыборкаТариф.Следующий() Цикл
							Если Тариф = "" Тогда
								Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;					
							Иначе
								Если ВыборкаТариф.Тариф = 0 Тогда
									Значение = "";
								Иначе
									Если ВыборкаТариф.Тариф = 0 Тогда
										Значение = "";
									Иначе	
										Значение = "\" + Строка(ВыборкаТариф.Тариф);
									КонецЕсли;	
								КонецЕсли;	
							КонецЕсли;
							Тариф = Тариф + Значение;		
							Если КоличествоЕдиниц <> ВыборкаТариф.КоличествоЕдИзм И ВыборкаТариф.КоличествоЕдИзм <> 0 Тогда
								Если ВыборкаТариф.Порог <> Неопределено Тогда
									КоличествоЕдиниц = КоличествоЕдиниц + ВыборкаТариф.КоличествоЕдИзм;
									Строка.Тариф = Тариф;
								Иначе	
									КоличествоЕдиниц = ВыборкаТариф.КоличествоЕдИзм;
									Строка.Тариф = Тариф;
								КонецЕсли;	
							КонецЕсли;
							
						КонецЦикла;
						Строка.ТекущиеПоказания    = ВыборкаПриборыУчета.ТекущиеПоказания;
						Строка.ПредыдущиеПоказания = ВыборкаПриборыУчета.ПредыдущиеПоказания;
						КорректировкаПоПрибору     = ВыборкаУслуга.Корректировка;
						ПерерасчетПоприбору        = ВыборкаУслуга.Перерасчет;
						Если СтараяУслуга <> НоваяУслуга  тогда
							Строка.Корректировка = ПерерасчетПоприбору + КорректировкаПоПрибору;
							Строка.Начисление = ВыборкаУслуга.Начисление;
						Иначе
							Строка.Начисление = ВыборкаУслуга.Начисление;
						КонецЕсли; 
						
						Марк = Ложь;
						СтараяУслуга = ВыборкаУслуга.Услуга;
					КонецЦикла;
					
					Если Марк = Ложь тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
					Если ВыборкаУслуга.Услуга = Справочники.Услуги.ПустаяСсылка() Тогда

					ИначеЕсли  ВыборкаУслуга.Услуга = Справочники.Услуги.РеструктуризацияДолга Тогда
						ДанныеПоРеструктуризацииДолга = ВыборкаУслуга.Начисление;  //метка
						Продолжить;
					Иначе
						Если ВыборкаУслуга.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000190") И ВыборкаУслуга.Корректировка < 0 Тогда // Розподіл х/в Миргород
							ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = "Повернення різнці розподілу загальнобудинкового лічильника";
						ИначеЕсли ВыборкаУслуга.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000215") И ВыборкаУслуга.Корректировка < 0 Тогда   // Розподіл х/в Багачка
							ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = "Повернення різнці розподілу загальнобудинкового лічильника";
						Иначе
						    ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = ВыборкаУслуга.Услуга.ПолноеНаименование;
						КонецЕсли;
						ОбластьСтрокаУслуг.Параметры.ЕдИзмер           = ВыборкаУслуга.ЕдиницаИзмерения;
					КонецЕсли;
					ВыборкаТариф = ВыборкаУслуга.Выбрать();
					Тариф = "";
					ДнейНачислено = 0;
					Пока ВыборкаТариф.Следующий() Цикл
						Если Тариф = "" Тогда
							Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
						Иначе 
							Если ВыборкаТариф.Тариф = 0 Тогда
								Значение = "";
							Иначе	
								Значение = "\"+Строка(ВыборкаТариф.Тариф);
							КонецЕсли;	
						КонецЕсли;
						Тариф = Тариф + Значение;
						Если НЕ ВыборкаТариф.Начисление = 0 Тогда
							ДнейНачислено = ДнейНачислено + ВыборкаТариф.ДнейНачислено;
						КонецЕсли;						
					КонецЦикла;
					Если ВыборкаУслуга.Услуга <> Справочники.Услуги.ПустаяСсылка() Тогда 
						ОбластьСтрокаУслуг.Параметры.Тариф        = Тариф;
						ОбластьСтрокаУслуг.Параметры.КолДней      = ВыборкаУслуга.КоличествоЕдИзм;
						ОбластьСтрокаУслуг.Параметры.НачисленоГрн = ВыборкаУслуга.Начисление;
						ОбластьСтрокаУслуг.Параметры.Пересчет     = ВыборкаУслуга.Перерасчет + ВыборкаУслуга.Корректировка;
					Иначе
						ОбластьСтрокаУслуг.Параметры.Тариф        = 0;
						ОбластьСтрокаУслуг.Параметры.КолДней      = 0;
						ОбластьСтрокаУслуг.Параметры.НачисленоГрн = 0;
						ОбластьСтрокаУслуг.Параметры.Пересчет     = 0;
					КонецЕсли;
					Начислено = ВыборкаУслуга.Начисление + ВыборкаУслуга.Перерасчет + ВыборкаУслуга.Корректировка;
					ОбластьСтрокаУслуг.Параметры.НачисленоГрн     = ВыборкаУслуга.Начисление;
					ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = Начислено;
					
					СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
					СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
					
					НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
					Если НайденныеСтроки.Количество() >  0  Тогда
						Долгпериода = НайденныеСтроки[0].СуммаОстаток;
					Иначе
						Долгпериода = 0;
					КонецЕсли;
					
					Долг = Долгпериода - ВыборкаУслуга.Оплата;
					
					Если ОбластьСтрокаУслуг.Параметры.НачисленоГрн <> 0 ИЛИ Начислено <> 0 Тогда					
						ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
					КонецЕсли;
				КонецЦикла;
				//////////////////////////////////////////////////////////////////////////////////////////////////////////
				
				// Лічильники ХВ, ГВ, ТЕ
				ОбластьПриборы = Макет.ПолучитьОбласть("СтрокаСчетчиков");
				УслугаСчетчика = "";
				ОбластьПриборы.Параметры.Насчитано = 0;
				ОбластьПриборы.Параметры.Тариф = 0;
				Для каждого Строка Из Таблица Цикл
					Если Строка.ТекущиеПоказания <> 0 Тогда // если нет текущих показаний тогда и выводить нечего	
						Если ПервыйСчетчик Тогда
							ОбластьШапкаСчетчика = Макет.ПолучитьОбласть("ШапкаОбщиеПоказателиСчетчика");
							
							ТабличныйДокумент.Вывести(ОбластьШапкаСчетчика);
							ПервыйСчетчик = Ложь;
						КонецЕсли;
						
						
						
						ОбластьПриборы.Параметры.Услуга = Строка.Услуга;
						ОбластьПриборы.Параметры.Счетчик = Строка.Счетчик;
						//ОбластьПриборы.Параметры.Коэффициент = Строка.Коэффициент;
						ОбластьПриборы.Параметры.ЕдИзмерения = Строка.ЕдИзм;
						ОбластьПриборы.Параметры.Тариф = Строка.Тариф;
						ОбластьПриборы.Параметры.Поточные = Строка.ТекущиеПоказания;
						ОбластьПриборы.Параметры.Предыдущие = Строка.ПредыдущиеПоказания;
						ОбластьПриборы.Параметры.Разница = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания;	
						
						Если УслугаСчетчика = "" Тогда
							УслугаСчетчика = Строка.Услуга;
							Если Строка.Тариф = Неопределено Тогда
								_Тариф = 0;
							    ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							ИначеЕсли Строка.Тариф = "" Тогда
								_Тариф = 0;
							    ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							Иначе
								ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * Число(Строка.Тариф);
							КонецЕсли;
							Если Строка.Корректировка = Неопределено Тогда
								_Корректировка = 0;
							    ОбластьПриборы.Параметры.Перерасчет = _Корректировка;
							Иначе
								_Корректировка = Строка.Корректировка;
								ОбластьПриборы.Параметры.Перерасчет = _Корректировка;
							КонецЕсли;
							ОбластьПриборы.Параметры.КОплате = ОбластьПриборы.Параметры.Насчитано + _Корректировка;
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ОбластьПриборы.Параметры.Насчитано + _Корректировка;
						ИначеЕсли УслугаСчетчика <> Строка.Услуга Тогда 
							УслугаСчетчика = Строка.Услуга;
							Если Строка.Тариф = Неопределено Тогда
								_Тариф = 0;
							    ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							ИначеЕсли Строка.Тариф = "" Тогда
								_Тариф = 0;
							    ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							Иначе
								_Тариф = Число(Строка.Тариф);
								ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							КонецЕсли;
							Если Строка.Корректировка = Неопределено Тогда
								_Корректировка = 0;
							    ОбластьПриборы.Параметры.Перерасчет = _Корректировка;
							Иначе
								_Корректировка = Строка.Корректировка;
								ОбластьПриборы.Параметры.Перерасчет = _Корректировка;
							КонецЕсли;
							ОбластьПриборы.Параметры.КОплате = ОбластьПриборы.Параметры.Насчитано + _Корректировка;
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ОбластьПриборы.Параметры.Насчитано + _Корректировка;
						Иначе
							УслугаСчетчика = Строка.Услуга;
							Если Строка.Тариф = Неопределено Тогда
								_Тариф = 0;
							    ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							ИначеЕсли Строка.Тариф = "" Тогда
								_Тариф = 0;
							    ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							Иначе
								_Тариф = Число(Строка.Тариф);
								ОбластьПриборы.Параметры.Насчитано = (Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания) * _Тариф;
							КонецЕсли;
							ОбластьПриборы.Параметры.Перерасчет = Строка.Корректировка;
							Если Строка.Корректировка = Неопределено Тогда
								_Корректировка = 0;
							    ОбластьПриборы.Параметры.КОплате = ОбластьПриборы.Параметры.Насчитано + _Корректировка;
							Иначе
								_Корректировка = Строка.Корректировка;
							КонецЕсли;
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ОбластьПриборы.Параметры.Насчитано + _Корректировка;
						КонецЕсли;					
						ТабличныйДокумент.Вывести(ОбластьПриборы);
						// Проверим нужна ли поверка прибора учета
						НужнаПоверка = ПроверитьПоверкуПрибораУчета(Строка.ЛицевойСчет, Строка.ПриборУчета);
						Если  НужнаПоверка <> Неопределено Тогда
							Если НужнаПоверка Тогда
								ОбластьПроверкаПрибораУчета = Макет.ПолучитьОбласть("ПроверкаПрибораУчета");
								//ДатаДляПроверки = ДобавитьМесяц(МесяцНачислений, 2);
								//ОбластьПроверкаПрибораУчета.Параметры.Дата = Формат(ДатаДляПроверки, "Л=uk_UA; ДФ=MMMM");
								ТабличныйДокумент.Вывести(ОбластьПроверкаПрибораУчета);
								//МассивВыводимыхОбластей.Добавить(ОбластьПроверкаПрибораУчета);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				//РЕструкткризацияДолга
				Если ЕстьРеструктуризация Тогда				
					ОбластьРеструкткризации = Макет.ПолучитьОбласть("ОбластьРеструктуризации");
					СтруктураПоиска = Новый Структура("ЛицевойСчет");
					СтруктураПоиска.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;				
					Пока ВыборкаПоРеструктуризацииДолга.НайтиСледующий(СтруктураПоиска) Цикл	
						СуммаОстатокПоРеструктуризации = ВыборкаПоРеструктуризацииДолга.ОстатокРеструктуризации;
						Если СуммаОстатокПоРеструктуризации <> 0 Тогда
							ОплаченоПлан = ПолучитьПредполагаемыеОплатыПоРеструктуризации(ТекущийДокумент, МесяцНачислений);
							ОплаченоФакт = ВыборкаПоРеструктуризацииДолга.Оплаты;
							ЗадолженностьПоРеструктуризации = ОплаченоПлан - ОплаченоФакт;
							ЗначениеРеструктуризацииДолга = ВыборкаПоРеструктуризацииДолга.СуммаПлатежа;
							Если ЗадолженностьПоРеструктуризации < 0 Тогда
								ЗадолженностьПоРеструктуризации = 0;
							КонецЕсли;	
							ОстатокПоРеструктуризации =  СуммаОстатокПоРеструктуризации - ЗадолженностьПоРеструктуризации;
							Если ОстатокПоРеструктуризации >= ЗначениеРеструктуризацииДолга Тогда
								МесячнаяПлатаПоРеструктуризации = ЗначениеРеструктуризацииДолга;
							иначе
								МесячнаяПлатаПоРеструктуризации = ОстатокПоРеструктуризации;
							КонецЕсли;  
							ОбластьРеструкткризации.Параметры.СуммаРеструктуризации = МесячнаяПлатаПоРеструктуризации;
							ОбластьРеструкткризации.Параметры.ОстатокРеструктуризации = ?(ОстатокПоРеструктуризации = 0,ВыборкаПоРеструктуризацииДолга.ОбщаяСумма,ОстатокПоРеструктуризации) ;
							ТабличныйДокумент.Вывести(ОбластьРеструкткризации);
							Если ЗадолженностьПоРеструктуризации <> 0 Тогда
								ОбластьЗадолженностиПореструктуризации = Макет.ПолучитьОбласть("ДолгПоРесруктуризации");
								ОбластьЗадолженностиПореструктуризации.Параметры.Задолженность = ЗадолженностьПоРеструктуризации;	
								ТабличныйДокумент.Вывести(ОбластьЗадолженностиПореструктуризации);	
							КонецЕсли;	
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					МесячнаяПлатаПоРеструктуризации = 0;
					ЗадолженностьПоРеструктуризации = 0;
				КонецЕсли;
				
				ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧастиАвансовый");
				ОбластьПодвалОсновной.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
				ОбластьПодвалОсновной.Параметры.ЛицевойСчет = ТекущийДокумент;;
				Попытка
					ОбластьПодвалОсновной.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				ОбластьПодвалОсновной.Параметры.Оплата = Оплаты;
				ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
				ОбластьПодвалОсновной.Параметры.Всего = Всего + МесячнаяПлатаПоРеструктуризации + ЗадолженностьПоРеструктуризации;
				ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
				
				// Область общедомовых счетчиков
				ОбщедомовыеПриборы = ПолучитьОбщедомовыеПриборыУчета(ТекущийДокумент.Владелец, МесяцНачислений);
				Если ОбщедомовыеПриборы.Количество() <> 0 Тогда
					ОбластьОДПУ = Макет.ПолучитьОбласть("ОбщедомовйПриборШапка");
					ТабличныйДокумент.Вывести(ОбластьОДПУ);
					
					ОбластьОДПУСтрока = Макет.ПолучитьОбласть("ОбщедомовойПриборДанные");
					
					Для Каждого стр Из ОбщедомовыеПриборы Цикл
						ОбластьОДПУСтрока.Параметры.ОбщедомовойПриборУчета = стр.ПриборУчета;
						ОбластьОДПУСтрока.Параметры.ЕденицаИзмерения = стр.ПриборУчета.ЕдиницаИзмерения;
						ОбластьОДПУСтрока.Параметры.ОДПУПоказанияПредыдущие = стр.ПоказаниеПредыдущее;
						ОбластьОДПУСтрока.Параметры.ОДПУПоказанияТекущие = стр.ПоказаниеТекущее;
						ОбластьОДПУСтрока.Параметры.ОДПУРазница = стр.РазницаПоказания;
						ТабличныйДокумент.Вывести(ОбластьОДПУСтрока);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	Возврат ТабличныйДокумент;
КонецФункции



/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьПредполагаемыеОплатыПоРеструктуризации(ЛицевыеСчета,МесяцНачисления)

	ЗАпрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет КАК ЛицевойСчет,
	                |	ПлатежиПоРеструктуризацииДолга.СуммаПлатежа КАК СуммаПлатежа
	                |ИЗ
	                |	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	                |ГДЕ
	                |	ПлатежиПоРеструктуризацииДолга.Период <= НачалоПериода(&МесяцНачисления, МЕСЯЦ)
	                |	И ПлатежиПоРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	                |ИТОГИ
	                |	СУММА(СуммаПлатежа)
	                |ПО
	                |	ЛицевойСчет";
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Результат  = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() тогда
		
	   Возврат Результат.СуммаПлатежа;
   Иначе
	   Возврат 0;
	КонецЕсли;   
	
	
КонецФункции // ПолучитьПредполагаемыеОплатыПоРеструктуризации()

Функция НомерБанковскогоСчетаСоответствуетСтандартуIBAN(НомерСчета) Экспорт
	
	Результат = Ложь;
	
	ДлинаНомера = СтрДлина(НомерСчета);
	КодСтраны = Лев(НомерСчета, 2);
	
	Если КодСтраны = "UA" И ДлинаНомера = 29 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьБанкПоНомеруСчетаIBAN(НомерСчета) Экспорт
	
	БанкПоСчету = Неопределено;
	
	КодБанка = ПолучитьКодБанкаПоНомеруСчетаIBAN(НомерСчета);
	
	Если ЗначениеЗаполнено(КодБанка) Тогда
		
		БанкПоСчету = Справочники.Банки.НайтиПоКоду(КодБанка);
		Если БанкПоСчету.Пустая() или БанкПоСчету.ЭтоГруппа Тогда
			БанкПоСчету = "";			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат БанкПоСчету;
	
КонецФункции

Функция ПолучитьКодБанкаПоНомеруСчетаIBAN(НомерСчета) Экспорт
	
	КодБанка = "";
	
	Если НомерБанковскогоСчетаСоответствуетСтандартуIBAN(НомерСчета) Тогда
		КодБанка = Сред(НомерСчета, 5, 6);
	КонецЕсли;
	
	Возврат КодБанка;
	
КонецФункции

Функция ПолучитьПредставлениеБанковскогоСчета(БанковскийСчет) Экспорт
	
	ДатаПериода = ТекущаяДата();
	
	НачалоПереходногоПериода = ОбщегоНазначенияПовтИсп.ПолучитьДатуНачалаПереходаНаСтандартIBAN();
	КонецПереходногоПериода = ОбщегоНазначенияПовтИсп.ПолучитьДатуОкончанияПереходаНаСтандартIBAN();
	ПервыйНомерСчета = "";
	ВторойНомерСчета = "";
	Если ДатаПериода > КонецПереходногоПериода Тогда
		ПервыйНомерСчета = БанковскийСчет.НомерСчета;
	ИначеЕсли ДатаПериода >= НачалоПереходногоПериода И ДатаПериода <= КонецПереходногоПериода Тогда
		ПервыйНомерСчета = БанковскийСчет.НомерСчета;
		Если ЗначениеЗаполнено(БанковскийСчет.НомерСчетаУстаревший) И БанковскийСчет.НомерСчетаУстаревший <> БанковскийСчет.НомерСчета Тогда
			ВторойНомерСчета = БанковскийСчет.НомерСчетаУстаревший;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(БанковскийСчет.НомерСчетаУстаревший) Тогда
			ПервыйНомерСчета = БанковскийСчет.НомерСчетаУстаревший;
		Иначе
			ПервыйНомерСчета = БанковскийСчет.НомерСчета;
		КонецЕсли;
	КонецЕсли;
	
	ПредставлениеСчета = "";
	Если ЗначениеЗаполнено(ПервыйНомерСчета) Тогда
		
		ПредставлениеСчета = ПервыйНомерСчета 
			+ ?(ЗначениеЗаполнено(ВторойНомерСчета), 
				" (" + НСтр("ru='устар. ';uk='застар. '") + ВторойНомерСчета + ")", "");

	КонецЕсли;
		
	Возврат ПредставлениеСчета;

КонецФункции

Функция ПолучитьОбщедомовыеПриборыУчета(Здание, ПериодНачисления)
	тзЗначения = Новый ТаблицаЗначений;
	тзЗначения.Колонки.Добавить("ПриборУчета");
	тзЗначения.Колонки.Добавить("ПоказаниеПредыдущее");
	тзЗначения.Колонки.Добавить("ПоказаниеТекущее");
	тзЗначения.Колонки.Добавить("РазницаПоказания");
	
	// Теплолічильк
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ПериодНачисления));
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийТеплосчетчика.ПриборУчета,
	    |	АктСнятияПоказанийТеплосчетчика.ПоказаниеПредыдущее,
	    |	АктСнятияПоказанийТеплосчетчика.ПоказаниеТекущее,
	    |	АктСнятияПоказанийТеплосчетчика.РазницаПоказания
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийТеплосчетчика КАК АктСнятияПоказанийТеплосчетчика
	    |ГДЕ
	    |	АктСнятияПоказанийТеплосчетчика.Период МЕЖДУ &НачПериода И &КонПериода
	    |	И АктСнятияПоказанийТеплосчетчика.Здание = &Здание";
	
	РезультатЗапросаТЕ = Запрос.Выполнить();
	Если НЕ РезультатЗапросаТЕ.Пустой() Тогда
		ВыборТЕ = РезультатЗапросаТЕ.Выгрузить();
		Для Каждого стр Из ВыборТЕ Цикл
			НовСтр = тзЗначения.Добавить();
			НовСтр.ПриборУчета = стр.ПриборУчета;
			НовСтр.ПоказаниеПредыдущее = стр.ПоказаниеПредыдущее;
			НовСтр.ПоказаниеТекущее = стр.ПоказаниеТекущее;
			НовСтр.РазницаПоказания = стр.РазницаПоказания;
		КонецЦикла;
	КонецЕсли;
	
	// Лічильник ГВ
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Здание", Здание);
	//Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ПериодНачисления));
	//Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ПериодНачисления));
	//Запрос.Текст =
	//    "ВЫБРАТЬ
	//    |	АктСнятияПоказанийГорячейВоды.ПриборУчета,
	//    |	АктСнятияПоказанийГорячейВоды.ПоказаниеПредыдущее,
	//    |	АктСнятияПоказанийГорячейВоды.ПоказаниеТекущее,
	//    |	АктСнятияПоказанийГорячейВоды.РазницаПоказания
	//    |ИЗ
	//    |	РегистрСведений.АктСнятияПоказанийГорячейВоды КАК АктСнятияПоказанийГорячейВоды
	//    |ГДЕ
	//    |	АктСнятияПоказанийГорячейВоды.Здание = &Здание
	//    |	И АктСнятияПоказанийГорячейВоды.Период МЕЖДУ &НачПериода И &КонПериода";
	//
	//РезультатЗапросаГВ = Запрос.Выполнить();
	//Если НЕ РезультатЗапросаГВ.Пустой() Тогда
	//	ВыборГВ = РезультатЗапросаГВ.Выгрузить();
	//	Для Каждого стр Из ВыборГВ Цикл
	//		НовСтр = тзЗначения.Добавить();
	//		НовСтр.ПриборУчета = стр.ПриборУчета;
	//		НовСтр.ПоказаниеПредыдущее = стр.ПоказаниеПредыдущее;
	//		НовСтр.ПоказаниеТекущее = стр.ПоказаниеТекущее;
	//		НовСтр.РазницаПоказания = стр.РазницаПоказания;
	//	КонецЦикла;
	//КонецЕсли;
	
	// Лічильник ХВ
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ПериодНачисления));
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийХолоднойВоды.ПриборУчета,
	    |	АктСнятияПоказанийХолоднойВоды.ПоказаниеПредыдущее,
	    |	АктСнятияПоказанийХолоднойВоды.ПоказаниеТекущее,
	    |	АктСнятияПоказанийХолоднойВоды.РазницаПоказания
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийХолоднойВоды КАК АктСнятияПоказанийХолоднойВоды
	    |ГДЕ
	    |	АктСнятияПоказанийХолоднойВоды.Период МЕЖДУ &НачПериода И &КонПериода
	    |	И АктСнятияПоказанийХолоднойВоды.Здание = &Здание";
	
	РезультатЗапросаХВ = Запрос.Выполнить();
	Если НЕ РезультатЗапросаХВ.Пустой() Тогда
		ВыборХВ = РезультатЗапросаХВ.Выгрузить();
		Для Каждого стр Из ВыборХВ Цикл
			НовСтр = тзЗначения.Добавить();
			НовСтр.ПриборУчета = стр.ПриборУчета;
			НовСтр.ПоказаниеПредыдущее = стр.ПоказаниеПредыдущее;
			НовСтр.ПоказаниеТекущее = стр.ПоказаниеТекущее;
			НовСтр.РазницаПоказания = стр.РазницаПоказания;
		КонецЦикла;
	КонецЕсли;
	
	Возврат тзЗначения;
КонецФункции

Функция ПроверитьПоверкуПрибораУчета(ОбъектУстановки, ПриборУчета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПоверкиПриборовУчетаСрезПоследних.Период,
	    |	ПоверкиПриборовУчетаСрезПоследних.ПоверкаВыполнена
	    |ИЗ
	    |	РегистрСведений.ПоверкиПриборовУчета.СрезПоследних(
	    |			&НаДату,
	    |			ОбъектУстановки = &ОбъектУстановки
	    |				И ПриборУчета = &ПриборУчета) КАК ПоверкиПриборовУчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектУстановки", ОбъектУстановки);
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Период <= ТекущаяДата() И Выборка.ПоверкаВыполнена = Ложь Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
КонецФункции
